## Plan Result (688: zr_prod_acr - TerraformPlanApply)




<pre><code>Plan: 1 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_container_registry.container_registry[&#34;hmctssbox&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_container_registry.container_registry["hmctssbox"] will be created
  + resource "azurerm_container_registry" "container_registry" {
      + admin_enabled                 = true
      + admin_password                = (sensitive value)
      + admin_username                = (known after apply)
      + anonymous_pull_enabled        = false
      + encryption                    = (known after apply)
      + export_policy_enabled         = true
      + id                            = (known after apply)
      + location                      = "uksouth"
      + login_server                  = (known after apply)
      + name                          = "hmctssbox"
      + network_rule_bypass_option    = "AzureServices"
      + network_rule_set              = (known after apply)
      + public_network_access_enabled = true
      + resource_group_name           = "rpe-acr-prod-rg"
      + retention_policy_in_days      = 1
      + sku                           = "Premium"
      + tags                          = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/acr-build-infrastructure"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "production"
        }
      + trust_policy_enabled          = false
      + zone_redundancy_enabled       = true
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

</details>





## :warning: Errors

* failed to add a label 688: zr_prod_acr - TerraformPlanApply/add-or-update: label name is too long (max: 50)
<!-- github-comment: {"Command":"plan","PRNumber":28,"Program":"tfcmt","SHA1":"","Target":"688: zr_prod_acr - TerraformPlanApply","Vars":{}} -->